IDEA StatiCa Open Model
ReinfBarOnEdge.EdgePositionType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Position of reinforcement on edge
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public EdgePositionType EdgePositionType { get; set; }
Public Property EdgePositionType As EdgePositionType
	Get
	Set
public:
property EdgePositionType EdgePositionType {
	EdgePositionType get ();
	void set (EdgePositionType value);
}
Property Value
Type: EdgePositionType
See Also
Reference
ReinfBarOnEdge Class
IdeaRS.OpenModel.Detail Namespace